export default {
  search: 'Поиск | Поиск в {count} треке | Поиск в {count} треках',
  specifySearchCriteria: 'Пожалуйста, введите поисковый запрос или выберите фильтры, чтобы найти больше.',
  filters: {
    sort: '⬇️ Порядок',
    authors: '👨‍🏫 Авторы',
    sources: '📚 Источники',
    locations: '🌎 Локации',
    languages: '🇺🇸 Языки',
    duration: '⏱️ Длительность',
    dates: '📅 Даты',
    durationShort: 'До 15 минут',
    durationMedium: '15-30 минут',
    durationLong: '30-60 минут',
    durationExtraLong: 'Более 60 минут',
  },
  notifications: {
    newTrackAddedToPlaylist: 'Трек добавлен в плейлист',
  }
}