export const ru = {
  otp: {
    enterLoginToReceiveCode:
      'Введите свой адрес электронной почты, чтобы получить одноразовый пароль (OTP) для аутентификации.',
    enterOtpWeSentYou: 'Введите одноразовый пароль, который мы вам отправили.',
    requestOtp: 'Запросить OTP',
    unableToRequestOtp:
      'Не удалось запросить OTP. Пожалуйста, проверьте правильность введенного адреса электронной почты.',
    unableToSignIn:
      'Не удалось войти в систему. Пожалуйста, проверьте правильность введенного одноразового пароля.',
  },
  signIn: 'Войти',
}
