export default {
  upNext: "Далі у черзі",
  playlistIsEmpty: "Плейлист порожній",
  tapToAddTracks: "Додайте лекції в розділі «Пошук»",
  tapToAddTracksWithPacks: "Додайте лекції в розділі «Пошук» або виберіть із пропозицій нижче",
  starterPacks: {
    error: "Не вдалося додати лекції",
  },
  subscriptionNag: {
    title: "Підтримати проєкт",
    description:
      "Слухай Садху безкоштовний завдяки вашій підтримці. Оформіть підписку, щоб допомогти проєкту зростати.",
    dismiss: "Сховати",
  },
  notificationsNag: {
    title: "Увімкнути нагадування",
    description:
      "Дозвольте сповіщення, щоб я нагадував про свята та події, пропонував лекції й стежив за вашим прогресом.",
    dismiss: "Сховати",
  },
}
